[{"fields": {"body": "Super Soft Sugar Cookies\r\n\r\n1 cup butter\r\n1 cup sugar\r\n1 cup sour cream\r\n2 eggs\r\n1 teaspoon vanilla\r\n1 teaspoon almond extract\r\n2 teaspoon baking powder\r\n½ teaspoon baking soda\r\npinch of salt\r\n¼ teaspoon nutmeg\r\n3 ½ - 4 cups flour\r\n\r\nButtercream Frosting:\r\n4 oz. cream cheese, softened\r\n1 ½ cups butter, softened\r\n4 cups powdered sugar\r\n1 teaspoon vanilla\r\n½ teaspoon almond extract\r\n4 tablespoons milk\r\nRed Food Coloring (for Valentine’s Day – I like to make the frosting pink)\r\nCream together softened butter with sugar, sour cream and eggs.  Add vanilla, almond extract, baking powder, baking soda, salt and nutmeg.  Slowly add flour, 1 cup at a time.  Dough should be a little sticky.  Refrigerate one hour. (This is a must!)  Knead dough gently on floured board.  Roll out about 3/8 inch thick and cut with cookie cutters.  Bake for 9 to 12 minutes at 350 degrees.  For the best cookies, remove when they are lightly golden around the edges before they brown.  Frost with Buttercream Frosting.  \r\nFrosting: Cream together cream cheese and butter.  Add powdered sugar, vanilla and almond extract.  Add milk one tablespoon at a time until desired consistency.  For Valentine’s Day, add a drop or two of red food coloring until desired shade of pink.\r\n", "picture": "pics/2015/09/17/lofthouse-sugar-cookies12.jpg", "blog_poster": "Celeste", "title": "Sugar Cookies", "active": true, "keywords": "Baking Desserts Cookies Valentine's Day", "category": [1, 2], "pub_date": "2015-09-19T18:00:00Z"}, "model": "blogapp.post", "pk": 1}, {"fields": {"body": "When I first started using vim I only knew two commands, how to go into insert mode and how to exit the file. Slowly I developed a better vim experience as I worked in vim. If you are a new vim then you are in the right place! I will give you step-by-step commands to learn. They go from most convenient, from my experience, to least. So the first few should be easy to remember since they help you go faster in vim.\r\n\r\nThe best way to learn new vim commands is to work in vim, stop and know there has to be an easier way to navigate or edit in vim and then go find that command. Although sometimes it is nice to have a cheat sheet to know those commands exist in the first place.\r\n\r\nI will try to remember all the commands I do. Vim has become a muscle memory for me, so sometimes I think I don't know a command, but it turns out that my fingers know it and I just don't know the characters of the command.\r\n\r\nCommands: (note, I will put new lines between learning steps, so that the commands to learn will be in bundles.)\r\n\r\n(Optional Command)\r\nIf you want to break a bad habit before it even begins, I suggest using the h, j, k, and l commands. They represent a way for you to keep your fingers on the keyboard the whole time. Don't use the arrow keys. You have to take your hands off the keyboard in order to use them and that slows you down. A good rule for good programmers is to never let your hands leave the keyboard.\r\n\r\nh = move left (left arrow)\r\nj = move up (up arrow)\r\nk = move down (down arrow)\r\nl = move right (right arrow)\r\n\r\nAt first this is weird by if you start with these then you never have to break a bad habit with using that arrow keys. I had to break a bad habit. If you are one of those people who want to learn this later, then that is fine. I will tell you at which step-by-step you should use start using them.\r\n\r\ni = insert mode (allows you to type normally), inserts behind the character you are currently on\r\nesc = exit button will let you get out of insert mode so you can use commands\r\n:q = quit file\r\n:w = write file\r\n:qw = write and quit file\r\n\r\nI use :w so often that when I am trying to save things that aren't on vim I end up typing :w.\r\n\r\ndd = deletes line but you can use p or P to paste it back in\r\np = paste line below\r\nP = paste line above\r\nZZ = save and quit (a faster command then :wq)\r\n\r\n:q! = force quit file (any changes you made to file will not be saved)\r\ngg = go to the top of the file\r\nG = go to the bottom of the file\r\n0 = go to beginning of line\r\n$ = go to ending of line\r\n\r\nV = lets you highlight lines of code then to use other commands to use multiple lines of code\r\nLines to use with the V command:\r\n> = lets you indent\r\n< = lets you undo indentation\r\nd = deletes your code but don't worry you can use P or p to paste it back in\r\n\r\nu = undo, undoes your last edit\r\n<ctr>R = redo, redoes your last edit\r\n. = repeats your last command so you don't have to retype the command (words well with bit commands like using V and then highlight lines of code and then indenting all those lines of code). If you click the . command it allows you to repeat those commands.\r\n/ = lets you search whatever you put after it, example:\r\n/hello = finds all words hello (case sensitive)\r\n\r\nI = insert mode, inserts you at the very beginning of the line of code\r\no = new line bellow and puts you in insert mode\r\nO = new line above and puts you in insert mode\r\n\r\nw = move over a word\r\nb = move back a word\r\nYou can specify how many words you want to move to or back from by putting a number in front of it like this:\r\n5w = move over five words\r\n8b = move back eight words\r\n4d = delete four words\r\n\r\n} = moves you down to a line with a newline and no code\r\n{ = moves you up to a line with a newline and no code", "picture": "", "blog_poster": "Celeste", "title": "Vim Learning Commands Step-By-Step", "active": true, "keywords": "Programming Editor Command-line", "category": [3], "pub_date": "2015-09-15T22:20:44.167Z"}, "model": "blogapp.post", "pk": 2}, {"fields": {"body": "Caramel \r\n2 c sugar\r\n1 c Karo syrup\r\n1 cube butter\r\n\r\nIn a 4 qt sauce pan constantly stir on high until the butter is melted then add:\r\n\r\n1 c cream\r\n\r\nBoil until soft ball 234 degrees (5 to 7 minutes). Then add:\r\n\r\n1 c cream\r\n\r\nBoil until 236 degrees or semi-soft ball (7 to 8 more minutes).\r\n\r\nTest in ice water for softness. To do this get cups of water fill them with ice water and put the caramel in so that way it cools down the caramel fast so you can taste test and see if the caramel is the consistence you want. You don't want to burn your mouth with caramel, it will give you 2nd degree burns.", "picture": "pics/2015/09/15/caramel.jpg", "blog_poster": "Celeste", "title": "Making Caramel", "active": true, "keywords": "Cooking Candy Holidays", "category": [1, 4], "pub_date": "2015-09-15T22:35:45.478Z"}, "model": "blogapp.post", "pk": 3}, {"fields": {"body": "I love dragons! I think they are one of the best magical creatures. I started collecting fairy stuff when I was twelve, I got bored of fairies and started collecting dragon stuff when I was fourteen. My room is very magical. I have fairy and dragon stuff all over the place. Last summer I had my cousin paint my walls. She painted a fantasy forest with a dragon! It looks amazing!\r\n\r\nSome of my favorite books have fantasy creatures in them. Fable Haven was a good book with lots of magical creatures including dragons! Harry Potter also has awesome dragons in their books and movies! The fourth book were Harry challenges a dragon and in the seventh book where he rides on a dragon to escape Gringotts Bank with the Horcrux Hufflepuff trophy!\r\n\r\nDid I mention I am also a Harry Potter fan?", "picture": "pics/2015/09/22/bluescales_qR79Nad.jpg", "blog_poster": "Celeste", "title": "Dragons", "active": true, "keywords": "Dragon Books", "category": [7, 8], "pub_date": "2015-09-22T22:45:29Z"}, "model": "blogapp.post", "pk": 20}, {"fields": {"person": "Victoria", "post": 1, "comment_text": "They taste like the sugar cookies at the Tooth Fairy or the Sugar Cookie! I can make them now and not have to go there and by one. They are a bit lighter and fluffier then the Tooth Fairy and Sugar Cookie cookies. ", "pub_date": "2015-09-13T17:30:08.520Z"}, "model": "blogapp.comment", "pk": 1}, {"fields": {"person": "Jana", "post": 1, "comment_text": "I recommend not using dye on the frosting because dye is very bad for your body. It's not like dye changes the way they taste.", "pub_date": "2015-09-13T17:31:08.158Z"}, "model": "blogapp.comment", "pk": 2}, {"fields": {"person": "Bryce", "post": 2, "comment_text": "What is the command for copy and paste?", "pub_date": "2015-09-15T22:20:40.235Z"}, "model": "blogapp.comment", "pk": 3}, {"fields": {"person": "Mike", "post": 1, "comment_text": "k", "pub_date": "2015-09-20T22:30:07.546Z"}, "model": "blogapp.comment", "pk": 4}, {"fields": {"person": "Mike", "post": 1, "comment_text": "Mmmm! I love cookies!", "pub_date": "2015-09-20T22:30:29.750Z"}, "model": "blogapp.comment", "pk": 5}, {"fields": {"person": "AJ", "post": 1, "comment_text": "When are we going to make those?", "pub_date": "2015-09-20T22:31:40.855Z"}, "model": "blogapp.comment", "pk": 6}, {"fields": {"person": "Mike", "post": 20, "comment_text": "I love Harry Potter too! The dragon scene in the fourth movie was really good and the dragon Harry got was awesome looking!", "pub_date": "2015-09-22T23:25:41.185Z"}, "model": "blogapp.comment", "pk": 7}, {"fields": {"person": "Jana", "post": 3, "comment_text": "I like to make fudge and caramel during Christmas!", "pub_date": "2015-09-23T00:52:57.384Z"}, "model": "blogapp.comment", "pk": 8}, {"fields": {"category_name": "Baking"}, "model": "blogapp.category", "pk": 1}, {"fields": {"category_name": "Desserts"}, "model": "blogapp.category", "pk": 2}, {"fields": {"category_name": "Programming"}, "model": "blogapp.category", "pk": 3}, {"fields": {"category_name": "Candy"}, "model": "blogapp.category", "pk": 4}, {"fields": {"category_name": "Other"}, "model": "blogapp.category", "pk": 5}, {"fields": {"category_name": "Random"}, "model": "blogapp.category", "pk": 7}, {"fields": {"category_name": "Magic"}, "model": "blogapp.category", "pk": 8}]